from random import randint

things = [
    'Магическое кольцо',
    'Кольчуга',
    'Кольцо всевластия',
    'Сапоги скороходы',
    'Двуручный меч',
    'Шлем теней',
    'Кольцо ярости',
    'Плащ ледяной бури',
    'Перчатки титана',
    'Амулет вечной жизни',
    'Сапоги безмолвия',
    'Пояс кровавого клинка',
    'Наплечники огненного воина',
    'Кристалл разума',
    'Мантия иллюзий',
    'Кинжал ядовитой змеи',
    'Часы остановленного времени',
    'Браслет грома',
    'Маска ночного охотника',
    'Кольчужный жилет берсерка'
]

class Thing:
    def __init__(self, name):
        self.name = name
        self.protection = randint(0, 10)
        self.attack = randint(0, 10)
        self.lives = randint(0, 10)

    def __str__(self):
        return (f'{self.name}: Защита {self.protection}, '
                f'Атака {self.attack}, Жизни {self.lives}')
